amken3d/arduino-rp2040/boards.txt
amken_bunny.menu.flash.134217728_5242880=128MB (Sketch: 123MB, FS: 5MB)
amken_bunny.menu.flash.134217728_5242880.upload.maximum_size=128970752
amken_bunny.menu.flash.134217728_5242880.build.flash_total=134217728
amken_bunny.menu.flash.134217728_5242880.build.flash_length=128970752
amken_bunny.menu.flash.134217728_5242880.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_5242880.build.fs_start=397406208
amken_bunny.menu.flash.134217728_5242880.build.fs_end=402649088
amken_bunny.menu.flash.134217728_6291456=128MB (Sketch: 122MB, FS: 6MB)
amken_bunny.menu.flash.134217728_6291456.upload.maximum_size=127922176
amken_bunny.menu.flash.134217728_6291456.build.flash_total=134217728
amken_bunny.menu.flash.134217728_6291456.build.flash_length=127922176
amken_bunny.menu.flash.134217728_6291456.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_6291456.build.fs_start=396357632
amken_bunny.menu.flash.134217728_6291456.build.fs_end=402649088
amken_bunny.menu.flash.134217728_7340032=128MB (Sketch: 121MB, FS: 7MB)
amken_bunny.menu.flash.134217728_7340032.upload.maximum_size=126873600
amken_bunny.menu.flash.134217728_7340032.build.flash_total=134217728
amken_bunny.menu.flash.134217728_7340032.build.flash_length=126873600
amken_bunny.menu.flash.134217728_7340032.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_7340032.build.fs_start=395309056
amken_bunny.menu.flash.134217728_7340032.build.fs_end=402649088
amken_bunny.menu.flash.134217728_8388608=128MB (Sketch: 120MB, FS: 8MB)
amken_bunny.menu.flash.134217728_8388608.upload.maximum_size=125825024
amken_bunny.menu.flash.134217728_8388608.build.flash_total=134217728
amken_bunny.menu.flash.134217728_8388608.build.flash_length=125825024
amken_bunny.menu.flash.134217728_8388608.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_8388608.build.fs_start=394260480
amken_bunny.menu.flash.134217728_8388608.build.fs_end=402649088
amken_bunny.menu.flash.134217728_9437184=128MB (Sketch: 119MB, FS: 9MB)
amken_bunny.menu.flash.134217728_9437184.upload.maximum_size=124776448
amken_bunny.menu.flash.134217728_9437184.build.flash_total=134217728
amken_bunny.menu.flash.134217728_9437184.build.flash_length=124776448
amken_bunny.menu.flash.134217728_9437184.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_9437184.build.fs_start=393211904
amken_bunny.menu.flash.134217728_9437184.build.fs_end=402649088
amken_bunny.menu.flash.134217728_10485760=128MB (Sketch: 118MB, FS: 10MB)
amken_bunny.menu.flash.134217728_10485760.upload.maximum_size=123727872
amken_bunny.menu.flash.134217728_10485760.build.flash_total=134217728
amken_bunny.menu.flash.134217728_10485760.build.flash_length=123727872
amken_bunny.menu.flash.134217728_10485760.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_10485760.build.fs_start=392163328
amken_bunny.menu.flash.134217728_10485760.build.fs_end=402649088
amken_bunny.menu.flash.134217728_11534336=128MB (Sketch: 117MB, FS: 11MB)
amken_bunny.menu.flash.134217728_11534336.upload.maximum_size=122679296
amken_bunny.menu.flash.134217728_11534336.build.flash_total=134217728
amken_bunny.menu.flash.134217728_11534336.build.flash_length=122679296
amken_bunny.menu.flash.134217728_11534336.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_11534336.build.fs_start=391114752
amken_bunny.menu.flash.134217728_11534336.build.fs_end=402649088
amken_bunny.menu.flash.134217728_12582912=128MB (Sketch: 116MB, FS: 12MB)
amken_bunny.menu.flash.134217728_12582912.upload.maximum_size=121630720
amken_bunny.menu.flash.134217728_12582912.build.flash_total=134217728
amken_bunny.menu.flash.134217728_12582912.build.flash_length=121630720
amken_bunny.menu.flash.134217728_12582912.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_12582912.build.fs_start=390066176
amken_bunny.menu.flash.134217728_12582912.build.fs_end=402649088
amken_bunny.menu.flash.134217728_13631488=128MB (Sketch: 115MB, FS: 13MB)
amken_bunny.menu.flash.134217728_13631488.upload.maximum_size=120582144
amken_bunny.menu.flash.134217728_13631488.build.flash_total=134217728
amken_bunny.menu.flash.134217728_13631488.build.flash_length=120582144
amken_bunny.menu.flash.134217728_13631488.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_13631488.build.fs_start=389017600
amken_bunny.menu.flash.134217728_13631488.build.fs_end=402649088
amken_bunny.menu.flash.134217728_14680064=128MB (Sketch: 114MB, FS: 14MB)
amken_bunny.menu.flash.134217728_14680064.upload.maximum_size=119533568
amken_bunny.menu.flash.134217728_14680064.build.flash_total=134217728
amken_bunny.menu.flash.134217728_14680064.build.flash_length=119533568
amken_bunny.menu.flash.134217728_14680064.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_14680064.build.fs_start=387969024
amken_bunny.menu.flash.134217728_14680064.build.fs_end=402649088
amken_bunny.menu.flash.134217728_15728640=128MB (Sketch: 113MB, FS: 15MB)
amken_bunny.menu.flash.134217728_15728640.upload.maximum_size=118484992
amken_bunny.menu.flash.134217728_15728640.build.flash_total=134217728
amken_bunny.menu.flash.134217728_15728640.build.flash_length=118484992
amken_bunny.menu.flash.134217728_15728640.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_15728640.build.fs_start=386920448
amken_bunny.menu.flash.134217728_15728640.build.fs_end=402649088
amken_bunny.menu.flash.134217728_16777216=128MB (Sketch: 112MB, FS: 16MB)
amken_bunny.menu.flash.134217728_16777216.upload.maximum_size=117436416
amken_bunny.menu.flash.134217728_16777216.build.flash_total=134217728
amken_bunny.menu.flash.134217728_16777216.build.flash_length=117436416
amken_bunny.menu.flash.134217728_16777216.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_16777216.build.fs_start=385871872
amken_bunny.menu.flash.134217728_16777216.build.fs_end=402649088
amken_bunny.menu.flash.134217728_17825792=128MB (Sketch: 111MB, FS: 17MB)
amken_bunny.menu.flash.134217728_17825792.upload.maximum_size=116387840
amken_bunny.menu.flash.134217728_17825792.build.flash_total=134217728
amken_bunny.menu.flash.134217728_17825792.build.flash_length=116387840
amken_bunny.menu.flash.134217728_17825792.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_17825792.build.fs_start=384823296
amken_bunny.menu.flash.134217728_17825792.build.fs_end=402649088
amken_bunny.menu.flash.134217728_18874368=128MB (Sketch: 110MB, FS: 18MB)
amken_bunny.menu.flash.134217728_18874368.upload.maximum_size=115339264
amken_bunny.menu.flash.134217728_18874368.build.flash_total=134217728
amken_bunny.menu.flash.134217728_18874368.build.flash_length=115339264
amken_bunny.menu.flash.134217728_18874368.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_18874368.build.fs_start=383774720
amken_bunny.menu.flash.134217728_18874368.build.fs_end=402649088
amken_bunny.menu.flash.134217728_19922944=128MB (Sketch: 109MB, FS: 19MB)
amken_bunny.menu.flash.134217728_19922944.upload.maximum_size=114290688
amken_bunny.menu.flash.134217728_19922944.build.flash_total=134217728
amken_bunny.menu.flash.134217728_19922944.build.flash_length=114290688
amken_bunny.menu.flash.134217728_19922944.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_19922944.build.fs_start=382726144
amken_bunny.menu.flash.134217728_19922944.build.fs_end=402649088
amken_bunny.menu.flash.134217728_20971520=128MB (Sketch: 108MB, FS: 20MB)
amken_bunny.menu.flash.134217728_20971520.upload.maximum_size=113242112
amken_bunny.menu.flash.134217728_20971520.build.flash_total=134217728
amken_bunny.menu.flash.134217728_20971520.build.flash_length=113242112
amken_bunny.menu.flash.134217728_20971520.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_20971520.build.fs_start=381677568
amken_bunny.menu.flash.134217728_20971520.build.fs_end=402649088
amken_bunny.menu.flash.134217728_22020096=128MB (Sketch: 107MB, FS: 21MB)
amken_bunny.menu.flash.134217728_22020096.upload.maximum_size=112193536
amken_bunny.menu.flash.134217728_22020096.build.flash_total=134217728
amken_bunny.menu.flash.134217728_22020096.build.flash_length=112193536
amken_bunny.menu.flash.134217728_22020096.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_22020096.build.fs_start=380628992
amken_bunny.menu.flash.134217728_22020096.build.fs_end=402649088
amken_bunny.menu.flash.134217728_23068672=128MB (Sketch: 106MB, FS: 22MB)
amken_bunny.menu.flash.134217728_23068672.upload.maximum_size=111144960
amken_bunny.menu.flash.134217728_23068672.build.flash_total=134217728
amken_bunny.menu.flash.134217728_23068672.build.flash_length=111144960
amken_bunny.menu.flash.134217728_23068672.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_23068672.build.fs_start=379580416
amken_bunny.menu.flash.134217728_23068672.build.fs_end=402649088
amken_bunny.menu.flash.134217728_24117248=128MB (Sketch: 105MB, FS: 23MB)
amken_bunny.menu.flash.134217728_24117248.upload.maximum_size=110096384
amken_bunny.menu.flash.134217728_24117248.build.flash_total=134217728
amken_bunny.menu.flash.134217728_24117248.build.flash_length=110096384
amken_bunny.menu.flash.134217728_24117248.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_24117248.build.fs_start=378531840
amken_bunny.menu.flash.134217728_24117248.build.fs_end=402649088
amken_bunny.menu.flash.134217728_25165824=128MB (Sketch: 104MB, FS: 24MB)
amken_bunny.menu.flash.134217728_25165824.upload.maximum_size=109047808
amken_bunny.menu.flash.134217728_25165824.build.flash_total=134217728
amken_bunny.menu.flash.134217728_25165824.build.flash_length=109047808
amken_bunny.menu.flash.134217728_25165824.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_25165824.build.fs_start=377483264
amken_bunny.menu.flash.134217728_25165824.build.fs_end=402649088
amken_bunny.menu.flash.134217728_26214400=128MB (Sketch: 103MB, FS: 25MB)
amken_bunny.menu.flash.134217728_26214400.upload.maximum_size=107999232
amken_bunny.menu.flash.134217728_26214400.build.flash_total=134217728
amken_bunny.menu.flash.134217728_26214400.build.flash_length=107999232
amken_bunny.menu.flash.134217728_26214400.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_26214400.build.fs_start=376434688
amken_bunny.menu.flash.134217728_26214400.build.fs_end=402649088
amken_bunny.menu.flash.134217728_27262976=128MB (Sketch: 102MB, FS: 26MB)
amken_bunny.menu.flash.134217728_27262976.upload.maximum_size=106950656
amken_bunny.menu.flash.134217728_27262976.build.flash_total=134217728
amken_bunny.menu.flash.134217728_27262976.build.flash_length=106950656
amken_bunny.menu.flash.134217728_27262976.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_27262976.build.fs_start=375386112
amken_bunny.menu.flash.134217728_27262976.build.fs_end=402649088
amken_bunny.menu.flash.134217728_28311552=128MB (Sketch: 101MB, FS: 27MB)
amken_bunny.menu.flash.134217728_28311552.upload.maximum_size=105902080
amken_bunny.menu.flash.134217728_28311552.build.flash_total=134217728
amken_bunny.menu.flash.134217728_28311552.build.flash_length=105902080
amken_bunny.menu.flash.134217728_28311552.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_28311552.build.fs_start=374337536
amken_bunny.menu.flash.134217728_28311552.build.fs_end=402649088
amken_bunny.menu.flash.134217728_29360128=128MB (Sketch: 100MB, FS: 28MB)
amken_bunny.menu.flash.134217728_29360128.upload.maximum_size=104853504
amken_bunny.menu.flash.134217728_29360128.build.flash_total=134217728
amken_bunny.menu.flash.134217728_29360128.build.flash_length=104853504
amken_bunny.menu.flash.134217728_29360128.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_29360128.build.fs_start=373288960
amken_bunny.menu.flash.134217728_29360128.build.fs_end=402649088
amken_bunny.menu.flash.134217728_30408704=128MB (Sketch: 99MB, FS: 29MB)
amken_bunny.menu.flash.134217728_30408704.upload.maximum_size=103804928
amken_bunny.menu.flash.134217728_30408704.build.flash_total=134217728
amken_bunny.menu.flash.134217728_30408704.build.flash_length=103804928
amken_bunny.menu.flash.134217728_30408704.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_30408704.build.fs_start=372240384
amken_bunny.menu.flash.134217728_30408704.build.fs_end=402649088
amken_bunny.menu.flash.134217728_31457280=128MB (Sketch: 98MB, FS: 30MB)
amken_bunny.menu.flash.134217728_31457280.upload.maximum_size=102756352
amken_bunny.menu.flash.134217728_31457280.build.flash_total=134217728
amken_bunny.menu.flash.134217728_31457280.build.flash_length=102756352
amken_bunny.menu.flash.134217728_31457280.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_31457280.build.fs_start=371191808
amken_bunny.menu.flash.134217728_31457280.build.fs_end=402649088
amken_bunny.menu.flash.134217728_32505856=128MB (Sketch: 97MB, FS: 31MB)
amken_bunny.menu.flash.134217728_32505856.upload.maximum_size=101707776
amken_bunny.menu.flash.134217728_32505856.build.flash_total=134217728
amken_bunny.menu.flash.134217728_32505856.build.flash_length=101707776
amken_bunny.menu.flash.134217728_32505856.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_32505856.build.fs_start=370143232
amken_bunny.menu.flash.134217728_32505856.build.fs_end=402649088
amken_bunny.menu.flash.134217728_33554432=128MB (Sketch: 96MB, FS: 32MB)
amken_bunny.menu.flash.134217728_33554432.upload.maximum_size=100659200
amken_bunny.menu.flash.134217728_33554432.build.flash_total=134217728
amken_bunny.menu.flash.134217728_33554432.build.flash_length=100659200
amken_bunny.menu.flash.134217728_33554432.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_33554432.build.fs_start=369094656
amken_bunny.menu.flash.134217728_33554432.build.fs_end=402649088
amken_bunny.menu.flash.134217728_34603008=128MB (Sketch: 95MB, FS: 33MB)
amken_bunny.menu.flash.134217728_34603008.upload.maximum_size=99610624
amken_bunny.menu.flash.134217728_34603008.build.flash_total=134217728
amken_bunny.menu.flash.134217728_34603008.build.flash_length=99610624
amken_bunny.menu.flash.134217728_34603008.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_34603008.build.fs_start=368046080
amken_bunny.menu.flash.134217728_34603008.build.fs_end=402649088
amken_bunny.menu.flash.134217728_35651584=128MB (Sketch: 94MB, FS: 34MB)
amken_bunny.menu.flash.134217728_35651584.upload.maximum_size=98562048
amken_bunny.menu.flash.134217728_35651584.build.flash_total=134217728
amken_bunny.menu.flash.134217728_35651584.build.flash_length=98562048
amken_bunny.menu.flash.134217728_35651584.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_35651584.build.fs_start=366997504
amken_bunny.menu.flash.134217728_35651584.build.fs_end=402649088
amken_bunny.menu.flash.134217728_36700160=128MB (Sketch: 93MB, FS: 35MB)
amken_bunny.menu.flash.134217728_36700160.upload.maximum_size=97513472
amken_bunny.menu.flash.134217728_36700160.build.flash_total=134217728
amken_bunny.menu.flash.134217728_36700160.build.flash_length=97513472
amken_bunny.menu.flash.134217728_36700160.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_36700160.build.fs_start=365948928
amken_bunny.menu.flash.134217728_36700160.build.fs_end=402649088
amken_bunny.menu.flash.134217728_37748736=128MB (Sketch: 92MB, FS: 36MB)
amken_bunny.menu.flash.134217728_37748736.upload.maximum_size=96464896
amken_bunny.menu.flash.134217728_37748736.build.flash_total=134217728
amken_bunny.menu.flash.134217728_37748736.build.flash_length=96464896
amken_bunny.menu.flash.134217728_37748736.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_37748736.build.fs_start=364900352
amken_bunny.menu.flash.134217728_37748736.build.fs_end=402649088
amken_bunny.menu.flash.134217728_38797312=128MB (Sketch: 91MB, FS: 37MB)
amken_bunny.menu.flash.134217728_38797312.upload.maximum_size=95416320
amken_bunny.menu.flash.134217728_38797312.build.flash_total=134217728
amken_bunny.menu.flash.134217728_38797312.build.flash_length=95416320
amken_bunny.menu.flash.134217728_38797312.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_38797312.build.fs_start=363851776
amken_bunny.menu.flash.134217728_38797312.build.fs_end=402649088
amken_bunny.menu.flash.134217728_39845888=128MB (Sketch: 90MB, FS: 38MB)
amken_bunny.menu.flash.134217728_39845888.upload.maximum_size=94367744
amken_bunny.menu.flash.134217728_39845888.build.flash_total=134217728
amken_bunny.menu.flash.134217728_39845888.build.flash_length=94367744
amken_bunny.menu.flash.134217728_39845888.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_39845888.build.fs_start=362803200
amken_bunny.menu.flash.134217728_39845888.build.fs_end=402649088
amken_bunny.menu.flash.134217728_40894464=128MB (Sketch: 89MB, FS: 39MB)
amken_bunny.menu.flash.134217728_40894464.upload.maximum_size=93319168
amken_bunny.menu.flash.134217728_40894464.build.flash_total=134217728
amken_bunny.menu.flash.134217728_40894464.build.flash_length=93319168
amken_bunny.menu.flash.134217728_40894464.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_40894464.build.fs_start=361754624
amken_bunny.menu.flash.134217728_40894464.build.fs_end=402649088
amken_bunny.menu.flash.134217728_41943040=128MB (Sketch: 88MB, FS: 40MB)
amken_bunny.menu.flash.134217728_41943040.upload.maximum_size=92270592
amken_bunny.menu.flash.134217728_41943040.build.flash_total=134217728
amken_bunny.menu.flash.134217728_41943040.build.flash_length=92270592
amken_bunny.menu.flash.134217728_41943040.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_41943040.build.fs_start=360706048
amken_bunny.menu.flash.134217728_41943040.build.fs_end=402649088
amken_bunny.menu.flash.134217728_42991616=128MB (Sketch: 87MB, FS: 41MB)
amken_bunny.menu.flash.134217728_42991616.upload.maximum_size=91222016
amken_bunny.menu.flash.134217728_42991616.build.flash_total=134217728
amken_bunny.menu.flash.134217728_42991616.build.flash_length=91222016
amken_bunny.menu.flash.134217728_42991616.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_42991616.build.fs_start=359657472
