amken3d/arduino-rp2040/boards.txt
amken_bunny.menu.flash.134217728_42991616.build.fs_end=402649088
amken_bunny.menu.flash.134217728_44040192=128MB (Sketch: 86MB, FS: 42MB)
amken_bunny.menu.flash.134217728_44040192.upload.maximum_size=90173440
amken_bunny.menu.flash.134217728_44040192.build.flash_total=134217728
amken_bunny.menu.flash.134217728_44040192.build.flash_length=90173440
amken_bunny.menu.flash.134217728_44040192.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_44040192.build.fs_start=358608896
amken_bunny.menu.flash.134217728_44040192.build.fs_end=402649088
amken_bunny.menu.flash.134217728_45088768=128MB (Sketch: 85MB, FS: 43MB)
amken_bunny.menu.flash.134217728_45088768.upload.maximum_size=89124864
amken_bunny.menu.flash.134217728_45088768.build.flash_total=134217728
amken_bunny.menu.flash.134217728_45088768.build.flash_length=89124864
amken_bunny.menu.flash.134217728_45088768.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_45088768.build.fs_start=357560320
amken_bunny.menu.flash.134217728_45088768.build.fs_end=402649088
amken_bunny.menu.flash.134217728_46137344=128MB (Sketch: 84MB, FS: 44MB)
amken_bunny.menu.flash.134217728_46137344.upload.maximum_size=88076288
amken_bunny.menu.flash.134217728_46137344.build.flash_total=134217728
amken_bunny.menu.flash.134217728_46137344.build.flash_length=88076288
amken_bunny.menu.flash.134217728_46137344.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_46137344.build.fs_start=356511744
amken_bunny.menu.flash.134217728_46137344.build.fs_end=402649088
amken_bunny.menu.flash.134217728_47185920=128MB (Sketch: 83MB, FS: 45MB)
amken_bunny.menu.flash.134217728_47185920.upload.maximum_size=87027712
amken_bunny.menu.flash.134217728_47185920.build.flash_total=134217728
amken_bunny.menu.flash.134217728_47185920.build.flash_length=87027712
amken_bunny.menu.flash.134217728_47185920.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_47185920.build.fs_start=355463168
amken_bunny.menu.flash.134217728_47185920.build.fs_end=402649088
amken_bunny.menu.flash.134217728_48234496=128MB (Sketch: 82MB, FS: 46MB)
amken_bunny.menu.flash.134217728_48234496.upload.maximum_size=85979136
amken_bunny.menu.flash.134217728_48234496.build.flash_total=134217728
amken_bunny.menu.flash.134217728_48234496.build.flash_length=85979136
amken_bunny.menu.flash.134217728_48234496.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_48234496.build.fs_start=354414592
amken_bunny.menu.flash.134217728_48234496.build.fs_end=402649088
amken_bunny.menu.flash.134217728_49283072=128MB (Sketch: 81MB, FS: 47MB)
amken_bunny.menu.flash.134217728_49283072.upload.maximum_size=84930560
amken_bunny.menu.flash.134217728_49283072.build.flash_total=134217728
amken_bunny.menu.flash.134217728_49283072.build.flash_length=84930560
amken_bunny.menu.flash.134217728_49283072.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_49283072.build.fs_start=353366016
amken_bunny.menu.flash.134217728_49283072.build.fs_end=402649088
amken_bunny.menu.flash.134217728_50331648=128MB (Sketch: 80MB, FS: 48MB)
amken_bunny.menu.flash.134217728_50331648.upload.maximum_size=83881984
amken_bunny.menu.flash.134217728_50331648.build.flash_total=134217728
amken_bunny.menu.flash.134217728_50331648.build.flash_length=83881984
amken_bunny.menu.flash.134217728_50331648.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_50331648.build.fs_start=352317440
amken_bunny.menu.flash.134217728_50331648.build.fs_end=402649088
amken_bunny.menu.flash.134217728_51380224=128MB (Sketch: 79MB, FS: 49MB)
amken_bunny.menu.flash.134217728_51380224.upload.maximum_size=82833408
amken_bunny.menu.flash.134217728_51380224.build.flash_total=134217728
amken_bunny.menu.flash.134217728_51380224.build.flash_length=82833408
amken_bunny.menu.flash.134217728_51380224.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_51380224.build.fs_start=351268864
amken_bunny.menu.flash.134217728_51380224.build.fs_end=402649088
amken_bunny.menu.flash.134217728_52428800=128MB (Sketch: 78MB, FS: 50MB)
amken_bunny.menu.flash.134217728_52428800.upload.maximum_size=81784832
amken_bunny.menu.flash.134217728_52428800.build.flash_total=134217728
amken_bunny.menu.flash.134217728_52428800.build.flash_length=81784832
amken_bunny.menu.flash.134217728_52428800.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_52428800.build.fs_start=350220288
amken_bunny.menu.flash.134217728_52428800.build.fs_end=402649088
amken_bunny.menu.flash.134217728_53477376=128MB (Sketch: 77MB, FS: 51MB)
amken_bunny.menu.flash.134217728_53477376.upload.maximum_size=80736256
amken_bunny.menu.flash.134217728_53477376.build.flash_total=134217728
amken_bunny.menu.flash.134217728_53477376.build.flash_length=80736256
amken_bunny.menu.flash.134217728_53477376.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_53477376.build.fs_start=349171712
amken_bunny.menu.flash.134217728_53477376.build.fs_end=402649088
amken_bunny.menu.flash.134217728_54525952=128MB (Sketch: 76MB, FS: 52MB)
amken_bunny.menu.flash.134217728_54525952.upload.maximum_size=79687680
amken_bunny.menu.flash.134217728_54525952.build.flash_total=134217728
amken_bunny.menu.flash.134217728_54525952.build.flash_length=79687680
amken_bunny.menu.flash.134217728_54525952.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_54525952.build.fs_start=348123136
amken_bunny.menu.flash.134217728_54525952.build.fs_end=402649088
amken_bunny.menu.flash.134217728_55574528=128MB (Sketch: 75MB, FS: 53MB)
amken_bunny.menu.flash.134217728_55574528.upload.maximum_size=78639104
amken_bunny.menu.flash.134217728_55574528.build.flash_total=134217728
amken_bunny.menu.flash.134217728_55574528.build.flash_length=78639104
amken_bunny.menu.flash.134217728_55574528.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_55574528.build.fs_start=347074560
amken_bunny.menu.flash.134217728_55574528.build.fs_end=402649088
amken_bunny.menu.flash.134217728_56623104=128MB (Sketch: 74MB, FS: 54MB)
amken_bunny.menu.flash.134217728_56623104.upload.maximum_size=77590528
amken_bunny.menu.flash.134217728_56623104.build.flash_total=134217728
amken_bunny.menu.flash.134217728_56623104.build.flash_length=77590528
amken_bunny.menu.flash.134217728_56623104.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_56623104.build.fs_start=346025984
amken_bunny.menu.flash.134217728_56623104.build.fs_end=402649088
amken_bunny.menu.flash.134217728_57671680=128MB (Sketch: 73MB, FS: 55MB)
amken_bunny.menu.flash.134217728_57671680.upload.maximum_size=76541952
amken_bunny.menu.flash.134217728_57671680.build.flash_total=134217728
amken_bunny.menu.flash.134217728_57671680.build.flash_length=76541952
amken_bunny.menu.flash.134217728_57671680.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_57671680.build.fs_start=344977408
amken_bunny.menu.flash.134217728_57671680.build.fs_end=402649088
amken_bunny.menu.flash.134217728_58720256=128MB (Sketch: 72MB, FS: 56MB)
amken_bunny.menu.flash.134217728_58720256.upload.maximum_size=75493376
amken_bunny.menu.flash.134217728_58720256.build.flash_total=134217728
amken_bunny.menu.flash.134217728_58720256.build.flash_length=75493376
amken_bunny.menu.flash.134217728_58720256.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_58720256.build.fs_start=343928832
amken_bunny.menu.flash.134217728_58720256.build.fs_end=402649088
amken_bunny.menu.flash.134217728_59768832=128MB (Sketch: 71MB, FS: 57MB)
amken_bunny.menu.flash.134217728_59768832.upload.maximum_size=74444800
amken_bunny.menu.flash.134217728_59768832.build.flash_total=134217728
amken_bunny.menu.flash.134217728_59768832.build.flash_length=74444800
amken_bunny.menu.flash.134217728_59768832.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_59768832.build.fs_start=342880256
amken_bunny.menu.flash.134217728_59768832.build.fs_end=402649088
amken_bunny.menu.flash.134217728_60817408=128MB (Sketch: 70MB, FS: 58MB)
amken_bunny.menu.flash.134217728_60817408.upload.maximum_size=73396224
amken_bunny.menu.flash.134217728_60817408.build.flash_total=134217728
amken_bunny.menu.flash.134217728_60817408.build.flash_length=73396224
amken_bunny.menu.flash.134217728_60817408.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_60817408.build.fs_start=341831680
amken_bunny.menu.flash.134217728_60817408.build.fs_end=402649088
amken_bunny.menu.flash.134217728_61865984=128MB (Sketch: 69MB, FS: 59MB)
amken_bunny.menu.flash.134217728_61865984.upload.maximum_size=72347648
amken_bunny.menu.flash.134217728_61865984.build.flash_total=134217728
amken_bunny.menu.flash.134217728_61865984.build.flash_length=72347648
amken_bunny.menu.flash.134217728_61865984.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_61865984.build.fs_start=340783104
amken_bunny.menu.flash.134217728_61865984.build.fs_end=402649088
amken_bunny.menu.flash.134217728_62914560=128MB (Sketch: 68MB, FS: 60MB)
amken_bunny.menu.flash.134217728_62914560.upload.maximum_size=71299072
amken_bunny.menu.flash.134217728_62914560.build.flash_total=134217728
amken_bunny.menu.flash.134217728_62914560.build.flash_length=71299072
amken_bunny.menu.flash.134217728_62914560.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_62914560.build.fs_start=339734528
amken_bunny.menu.flash.134217728_62914560.build.fs_end=402649088
amken_bunny.menu.flash.134217728_63963136=128MB (Sketch: 67MB, FS: 61MB)
amken_bunny.menu.flash.134217728_63963136.upload.maximum_size=70250496
amken_bunny.menu.flash.134217728_63963136.build.flash_total=134217728
amken_bunny.menu.flash.134217728_63963136.build.flash_length=70250496
amken_bunny.menu.flash.134217728_63963136.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_63963136.build.fs_start=338685952
amken_bunny.menu.flash.134217728_63963136.build.fs_end=402649088
amken_bunny.menu.flash.134217728_65011712=128MB (Sketch: 66MB, FS: 62MB)
amken_bunny.menu.flash.134217728_65011712.upload.maximum_size=69201920
amken_bunny.menu.flash.134217728_65011712.build.flash_total=134217728
amken_bunny.menu.flash.134217728_65011712.build.flash_length=69201920
amken_bunny.menu.flash.134217728_65011712.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_65011712.build.fs_start=337637376
amken_bunny.menu.flash.134217728_65011712.build.fs_end=402649088
amken_bunny.menu.flash.134217728_66060288=128MB (Sketch: 65MB, FS: 63MB)
amken_bunny.menu.flash.134217728_66060288.upload.maximum_size=68153344
amken_bunny.menu.flash.134217728_66060288.build.flash_total=134217728
amken_bunny.menu.flash.134217728_66060288.build.flash_length=68153344
amken_bunny.menu.flash.134217728_66060288.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_66060288.build.fs_start=336588800
amken_bunny.menu.flash.134217728_66060288.build.fs_end=402649088
amken_bunny.menu.flash.134217728_67108864=128MB (Sketch: 64MB, FS: 64MB)
amken_bunny.menu.flash.134217728_67108864.upload.maximum_size=67104768
amken_bunny.menu.flash.134217728_67108864.build.flash_total=134217728
amken_bunny.menu.flash.134217728_67108864.build.flash_length=67104768
amken_bunny.menu.flash.134217728_67108864.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_67108864.build.fs_start=335540224
amken_bunny.menu.flash.134217728_67108864.build.fs_end=402649088
amken_bunny.menu.flash.134217728_68157440=128MB (Sketch: 63MB, FS: 65MB)
amken_bunny.menu.flash.134217728_68157440.upload.maximum_size=66056192
amken_bunny.menu.flash.134217728_68157440.build.flash_total=134217728
amken_bunny.menu.flash.134217728_68157440.build.flash_length=66056192
amken_bunny.menu.flash.134217728_68157440.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_68157440.build.fs_start=334491648
amken_bunny.menu.flash.134217728_68157440.build.fs_end=402649088
amken_bunny.menu.flash.134217728_69206016=128MB (Sketch: 62MB, FS: 66MB)
amken_bunny.menu.flash.134217728_69206016.upload.maximum_size=65007616
amken_bunny.menu.flash.134217728_69206016.build.flash_total=134217728
amken_bunny.menu.flash.134217728_69206016.build.flash_length=65007616
amken_bunny.menu.flash.134217728_69206016.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_69206016.build.fs_start=333443072
amken_bunny.menu.flash.134217728_69206016.build.fs_end=402649088
amken_bunny.menu.flash.134217728_70254592=128MB (Sketch: 61MB, FS: 67MB)
amken_bunny.menu.flash.134217728_70254592.upload.maximum_size=63959040
amken_bunny.menu.flash.134217728_70254592.build.flash_total=134217728
amken_bunny.menu.flash.134217728_70254592.build.flash_length=63959040
amken_bunny.menu.flash.134217728_70254592.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_70254592.build.fs_start=332394496
amken_bunny.menu.flash.134217728_70254592.build.fs_end=402649088
amken_bunny.menu.flash.134217728_71303168=128MB (Sketch: 60MB, FS: 68MB)
amken_bunny.menu.flash.134217728_71303168.upload.maximum_size=62910464
amken_bunny.menu.flash.134217728_71303168.build.flash_total=134217728
amken_bunny.menu.flash.134217728_71303168.build.flash_length=62910464
amken_bunny.menu.flash.134217728_71303168.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_71303168.build.fs_start=331345920
amken_bunny.menu.flash.134217728_71303168.build.fs_end=402649088
amken_bunny.menu.flash.134217728_72351744=128MB (Sketch: 59MB, FS: 69MB)
amken_bunny.menu.flash.134217728_72351744.upload.maximum_size=61861888
amken_bunny.menu.flash.134217728_72351744.build.flash_total=134217728
amken_bunny.menu.flash.134217728_72351744.build.flash_length=61861888
amken_bunny.menu.flash.134217728_72351744.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_72351744.build.fs_start=330297344
amken_bunny.menu.flash.134217728_72351744.build.fs_end=402649088
amken_bunny.menu.flash.134217728_73400320=128MB (Sketch: 58MB, FS: 70MB)
amken_bunny.menu.flash.134217728_73400320.upload.maximum_size=60813312
amken_bunny.menu.flash.134217728_73400320.build.flash_total=134217728
amken_bunny.menu.flash.134217728_73400320.build.flash_length=60813312
amken_bunny.menu.flash.134217728_73400320.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_73400320.build.fs_start=329248768
amken_bunny.menu.flash.134217728_73400320.build.fs_end=402649088
amken_bunny.menu.flash.134217728_74448896=128MB (Sketch: 57MB, FS: 71MB)
amken_bunny.menu.flash.134217728_74448896.upload.maximum_size=59764736
amken_bunny.menu.flash.134217728_74448896.build.flash_total=134217728
amken_bunny.menu.flash.134217728_74448896.build.flash_length=59764736
amken_bunny.menu.flash.134217728_74448896.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_74448896.build.fs_start=328200192
amken_bunny.menu.flash.134217728_74448896.build.fs_end=402649088
amken_bunny.menu.flash.134217728_75497472=128MB (Sketch: 56MB, FS: 72MB)
amken_bunny.menu.flash.134217728_75497472.upload.maximum_size=58716160
amken_bunny.menu.flash.134217728_75497472.build.flash_total=134217728
amken_bunny.menu.flash.134217728_75497472.build.flash_length=58716160
amken_bunny.menu.flash.134217728_75497472.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_75497472.build.fs_start=327151616
amken_bunny.menu.flash.134217728_75497472.build.fs_end=402649088
amken_bunny.menu.flash.134217728_76546048=128MB (Sketch: 55MB, FS: 73MB)
amken_bunny.menu.flash.134217728_76546048.upload.maximum_size=57667584
amken_bunny.menu.flash.134217728_76546048.build.flash_total=134217728
amken_bunny.menu.flash.134217728_76546048.build.flash_length=57667584
amken_bunny.menu.flash.134217728_76546048.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_76546048.build.fs_start=326103040
amken_bunny.menu.flash.134217728_76546048.build.fs_end=402649088
amken_bunny.menu.flash.134217728_77594624=128MB (Sketch: 54MB, FS: 74MB)
amken_bunny.menu.flash.134217728_77594624.upload.maximum_size=56619008
amken_bunny.menu.flash.134217728_77594624.build.flash_total=134217728
amken_bunny.menu.flash.134217728_77594624.build.flash_length=56619008
amken_bunny.menu.flash.134217728_77594624.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_77594624.build.fs_start=325054464
amken_bunny.menu.flash.134217728_77594624.build.fs_end=402649088
amken_bunny.menu.flash.134217728_78643200=128MB (Sketch: 53MB, FS: 75MB)
amken_bunny.menu.flash.134217728_78643200.upload.maximum_size=55570432
amken_bunny.menu.flash.134217728_78643200.build.flash_total=134217728
amken_bunny.menu.flash.134217728_78643200.build.flash_length=55570432
amken_bunny.menu.flash.134217728_78643200.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_78643200.build.fs_start=324005888
amken_bunny.menu.flash.134217728_78643200.build.fs_end=402649088
amken_bunny.menu.flash.134217728_79691776=128MB (Sketch: 52MB, FS: 76MB)
amken_bunny.menu.flash.134217728_79691776.upload.maximum_size=54521856
amken_bunny.menu.flash.134217728_79691776.build.flash_total=134217728
amken_bunny.menu.flash.134217728_79691776.build.flash_length=54521856
amken_bunny.menu.flash.134217728_79691776.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_79691776.build.fs_start=322957312
amken_bunny.menu.flash.134217728_79691776.build.fs_end=402649088
amken_bunny.menu.flash.134217728_80740352=128MB (Sketch: 51MB, FS: 77MB)
amken_bunny.menu.flash.134217728_80740352.upload.maximum_size=53473280
amken_bunny.menu.flash.134217728_80740352.build.flash_total=134217728
amken_bunny.menu.flash.134217728_80740352.build.flash_length=53473280
amken_bunny.menu.flash.134217728_80740352.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_80740352.build.fs_start=321908736
amken_bunny.menu.flash.134217728_80740352.build.fs_end=402649088
amken_bunny.menu.flash.134217728_81788928=128MB (Sketch: 50MB, FS: 78MB)
amken_bunny.menu.flash.134217728_81788928.upload.maximum_size=52424704
amken_bunny.menu.flash.134217728_81788928.build.flash_total=134217728
amken_bunny.menu.flash.134217728_81788928.build.flash_length=52424704
amken_bunny.menu.flash.134217728_81788928.build.eeprom_start=402649088
