amken3d/arduino-rp2040/boards.txt
amken_bunny.menu.flash.134217728_81788928.build.fs_start=320860160
amken_bunny.menu.flash.134217728_81788928.build.fs_end=402649088
amken_bunny.menu.flash.134217728_82837504=128MB (Sketch: 49MB, FS: 79MB)
amken_bunny.menu.flash.134217728_82837504.upload.maximum_size=51376128
amken_bunny.menu.flash.134217728_82837504.build.flash_total=134217728
amken_bunny.menu.flash.134217728_82837504.build.flash_length=51376128
amken_bunny.menu.flash.134217728_82837504.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_82837504.build.fs_start=319811584
amken_bunny.menu.flash.134217728_82837504.build.fs_end=402649088
amken_bunny.menu.flash.134217728_83886080=128MB (Sketch: 48MB, FS: 80MB)
amken_bunny.menu.flash.134217728_83886080.upload.maximum_size=50327552
amken_bunny.menu.flash.134217728_83886080.build.flash_total=134217728
amken_bunny.menu.flash.134217728_83886080.build.flash_length=50327552
amken_bunny.menu.flash.134217728_83886080.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_83886080.build.fs_start=318763008
amken_bunny.menu.flash.134217728_83886080.build.fs_end=402649088
amken_bunny.menu.flash.134217728_84934656=128MB (Sketch: 47MB, FS: 81MB)
amken_bunny.menu.flash.134217728_84934656.upload.maximum_size=49278976
amken_bunny.menu.flash.134217728_84934656.build.flash_total=134217728
amken_bunny.menu.flash.134217728_84934656.build.flash_length=49278976
amken_bunny.menu.flash.134217728_84934656.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_84934656.build.fs_start=317714432
amken_bunny.menu.flash.134217728_84934656.build.fs_end=402649088
amken_bunny.menu.flash.134217728_85983232=128MB (Sketch: 46MB, FS: 82MB)
amken_bunny.menu.flash.134217728_85983232.upload.maximum_size=48230400
amken_bunny.menu.flash.134217728_85983232.build.flash_total=134217728
amken_bunny.menu.flash.134217728_85983232.build.flash_length=48230400
amken_bunny.menu.flash.134217728_85983232.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_85983232.build.fs_start=316665856
amken_bunny.menu.flash.134217728_85983232.build.fs_end=402649088
amken_bunny.menu.flash.134217728_87031808=128MB (Sketch: 45MB, FS: 83MB)
amken_bunny.menu.flash.134217728_87031808.upload.maximum_size=47181824
amken_bunny.menu.flash.134217728_87031808.build.flash_total=134217728
amken_bunny.menu.flash.134217728_87031808.build.flash_length=47181824
amken_bunny.menu.flash.134217728_87031808.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_87031808.build.fs_start=315617280
amken_bunny.menu.flash.134217728_87031808.build.fs_end=402649088
amken_bunny.menu.flash.134217728_88080384=128MB (Sketch: 44MB, FS: 84MB)
amken_bunny.menu.flash.134217728_88080384.upload.maximum_size=46133248
amken_bunny.menu.flash.134217728_88080384.build.flash_total=134217728
amken_bunny.menu.flash.134217728_88080384.build.flash_length=46133248
amken_bunny.menu.flash.134217728_88080384.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_88080384.build.fs_start=314568704
amken_bunny.menu.flash.134217728_88080384.build.fs_end=402649088
amken_bunny.menu.flash.134217728_89128960=128MB (Sketch: 43MB, FS: 85MB)
amken_bunny.menu.flash.134217728_89128960.upload.maximum_size=45084672
amken_bunny.menu.flash.134217728_89128960.build.flash_total=134217728
amken_bunny.menu.flash.134217728_89128960.build.flash_length=45084672
amken_bunny.menu.flash.134217728_89128960.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_89128960.build.fs_start=313520128
amken_bunny.menu.flash.134217728_89128960.build.fs_end=402649088
amken_bunny.menu.flash.134217728_90177536=128MB (Sketch: 42MB, FS: 86MB)
amken_bunny.menu.flash.134217728_90177536.upload.maximum_size=44036096
amken_bunny.menu.flash.134217728_90177536.build.flash_total=134217728
amken_bunny.menu.flash.134217728_90177536.build.flash_length=44036096
amken_bunny.menu.flash.134217728_90177536.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_90177536.build.fs_start=312471552
amken_bunny.menu.flash.134217728_90177536.build.fs_end=402649088
amken_bunny.menu.flash.134217728_91226112=128MB (Sketch: 41MB, FS: 87MB)
amken_bunny.menu.flash.134217728_91226112.upload.maximum_size=42987520
amken_bunny.menu.flash.134217728_91226112.build.flash_total=134217728
amken_bunny.menu.flash.134217728_91226112.build.flash_length=42987520
amken_bunny.menu.flash.134217728_91226112.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_91226112.build.fs_start=311422976
amken_bunny.menu.flash.134217728_91226112.build.fs_end=402649088
amken_bunny.menu.flash.134217728_92274688=128MB (Sketch: 40MB, FS: 88MB)
amken_bunny.menu.flash.134217728_92274688.upload.maximum_size=41938944
amken_bunny.menu.flash.134217728_92274688.build.flash_total=134217728
amken_bunny.menu.flash.134217728_92274688.build.flash_length=41938944
amken_bunny.menu.flash.134217728_92274688.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_92274688.build.fs_start=310374400
amken_bunny.menu.flash.134217728_92274688.build.fs_end=402649088
amken_bunny.menu.flash.134217728_93323264=128MB (Sketch: 39MB, FS: 89MB)
amken_bunny.menu.flash.134217728_93323264.upload.maximum_size=40890368
amken_bunny.menu.flash.134217728_93323264.build.flash_total=134217728
amken_bunny.menu.flash.134217728_93323264.build.flash_length=40890368
amken_bunny.menu.flash.134217728_93323264.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_93323264.build.fs_start=309325824
amken_bunny.menu.flash.134217728_93323264.build.fs_end=402649088
amken_bunny.menu.flash.134217728_94371840=128MB (Sketch: 38MB, FS: 90MB)
amken_bunny.menu.flash.134217728_94371840.upload.maximum_size=39841792
amken_bunny.menu.flash.134217728_94371840.build.flash_total=134217728
amken_bunny.menu.flash.134217728_94371840.build.flash_length=39841792
amken_bunny.menu.flash.134217728_94371840.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_94371840.build.fs_start=308277248
amken_bunny.menu.flash.134217728_94371840.build.fs_end=402649088
amken_bunny.menu.flash.134217728_95420416=128MB (Sketch: 37MB, FS: 91MB)
amken_bunny.menu.flash.134217728_95420416.upload.maximum_size=38793216
amken_bunny.menu.flash.134217728_95420416.build.flash_total=134217728
amken_bunny.menu.flash.134217728_95420416.build.flash_length=38793216
amken_bunny.menu.flash.134217728_95420416.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_95420416.build.fs_start=307228672
amken_bunny.menu.flash.134217728_95420416.build.fs_end=402649088
amken_bunny.menu.flash.134217728_96468992=128MB (Sketch: 36MB, FS: 92MB)
amken_bunny.menu.flash.134217728_96468992.upload.maximum_size=37744640
amken_bunny.menu.flash.134217728_96468992.build.flash_total=134217728
amken_bunny.menu.flash.134217728_96468992.build.flash_length=37744640
amken_bunny.menu.flash.134217728_96468992.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_96468992.build.fs_start=306180096
amken_bunny.menu.flash.134217728_96468992.build.fs_end=402649088
amken_bunny.menu.flash.134217728_97517568=128MB (Sketch: 35MB, FS: 93MB)
amken_bunny.menu.flash.134217728_97517568.upload.maximum_size=36696064
amken_bunny.menu.flash.134217728_97517568.build.flash_total=134217728
amken_bunny.menu.flash.134217728_97517568.build.flash_length=36696064
amken_bunny.menu.flash.134217728_97517568.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_97517568.build.fs_start=305131520
amken_bunny.menu.flash.134217728_97517568.build.fs_end=402649088
amken_bunny.menu.flash.134217728_98566144=128MB (Sketch: 34MB, FS: 94MB)
amken_bunny.menu.flash.134217728_98566144.upload.maximum_size=35647488
amken_bunny.menu.flash.134217728_98566144.build.flash_total=134217728
amken_bunny.menu.flash.134217728_98566144.build.flash_length=35647488
amken_bunny.menu.flash.134217728_98566144.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_98566144.build.fs_start=304082944
amken_bunny.menu.flash.134217728_98566144.build.fs_end=402649088
amken_bunny.menu.flash.134217728_99614720=128MB (Sketch: 33MB, FS: 95MB)
amken_bunny.menu.flash.134217728_99614720.upload.maximum_size=34598912
amken_bunny.menu.flash.134217728_99614720.build.flash_total=134217728
amken_bunny.menu.flash.134217728_99614720.build.flash_length=34598912
amken_bunny.menu.flash.134217728_99614720.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_99614720.build.fs_start=303034368
amken_bunny.menu.flash.134217728_99614720.build.fs_end=402649088
amken_bunny.menu.flash.134217728_100663296=128MB (Sketch: 32MB, FS: 96MB)
amken_bunny.menu.flash.134217728_100663296.upload.maximum_size=33550336
amken_bunny.menu.flash.134217728_100663296.build.flash_total=134217728
amken_bunny.menu.flash.134217728_100663296.build.flash_length=33550336
amken_bunny.menu.flash.134217728_100663296.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_100663296.build.fs_start=301985792
amken_bunny.menu.flash.134217728_100663296.build.fs_end=402649088
amken_bunny.menu.flash.134217728_101711872=128MB (Sketch: 31MB, FS: 97MB)
amken_bunny.menu.flash.134217728_101711872.upload.maximum_size=32501760
amken_bunny.menu.flash.134217728_101711872.build.flash_total=134217728
amken_bunny.menu.flash.134217728_101711872.build.flash_length=32501760
amken_bunny.menu.flash.134217728_101711872.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_101711872.build.fs_start=300937216
amken_bunny.menu.flash.134217728_101711872.build.fs_end=402649088
amken_bunny.menu.flash.134217728_102760448=128MB (Sketch: 30MB, FS: 98MB)
amken_bunny.menu.flash.134217728_102760448.upload.maximum_size=31453184
amken_bunny.menu.flash.134217728_102760448.build.flash_total=134217728
amken_bunny.menu.flash.134217728_102760448.build.flash_length=31453184
amken_bunny.menu.flash.134217728_102760448.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_102760448.build.fs_start=299888640
amken_bunny.menu.flash.134217728_102760448.build.fs_end=402649088
amken_bunny.menu.flash.134217728_103809024=128MB (Sketch: 29MB, FS: 99MB)
amken_bunny.menu.flash.134217728_103809024.upload.maximum_size=30404608
amken_bunny.menu.flash.134217728_103809024.build.flash_total=134217728
amken_bunny.menu.flash.134217728_103809024.build.flash_length=30404608
amken_bunny.menu.flash.134217728_103809024.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_103809024.build.fs_start=298840064
amken_bunny.menu.flash.134217728_103809024.build.fs_end=402649088
amken_bunny.menu.flash.134217728_104857600=128MB (Sketch: 28MB, FS: 100MB)
amken_bunny.menu.flash.134217728_104857600.upload.maximum_size=29356032
amken_bunny.menu.flash.134217728_104857600.build.flash_total=134217728
amken_bunny.menu.flash.134217728_104857600.build.flash_length=29356032
amken_bunny.menu.flash.134217728_104857600.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_104857600.build.fs_start=297791488
amken_bunny.menu.flash.134217728_104857600.build.fs_end=402649088
amken_bunny.menu.flash.134217728_105906176=128MB (Sketch: 27MB, FS: 101MB)
amken_bunny.menu.flash.134217728_105906176.upload.maximum_size=28307456
amken_bunny.menu.flash.134217728_105906176.build.flash_total=134217728
amken_bunny.menu.flash.134217728_105906176.build.flash_length=28307456
amken_bunny.menu.flash.134217728_105906176.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_105906176.build.fs_start=296742912
amken_bunny.menu.flash.134217728_105906176.build.fs_end=402649088
amken_bunny.menu.flash.134217728_106954752=128MB (Sketch: 26MB, FS: 102MB)
amken_bunny.menu.flash.134217728_106954752.upload.maximum_size=27258880
amken_bunny.menu.flash.134217728_106954752.build.flash_total=134217728
amken_bunny.menu.flash.134217728_106954752.build.flash_length=27258880
amken_bunny.menu.flash.134217728_106954752.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_106954752.build.fs_start=295694336
amken_bunny.menu.flash.134217728_106954752.build.fs_end=402649088
amken_bunny.menu.flash.134217728_108003328=128MB (Sketch: 25MB, FS: 103MB)
amken_bunny.menu.flash.134217728_108003328.upload.maximum_size=26210304
amken_bunny.menu.flash.134217728_108003328.build.flash_total=134217728
amken_bunny.menu.flash.134217728_108003328.build.flash_length=26210304
amken_bunny.menu.flash.134217728_108003328.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_108003328.build.fs_start=294645760
amken_bunny.menu.flash.134217728_108003328.build.fs_end=402649088
amken_bunny.menu.flash.134217728_109051904=128MB (Sketch: 24MB, FS: 104MB)
amken_bunny.menu.flash.134217728_109051904.upload.maximum_size=25161728
amken_bunny.menu.flash.134217728_109051904.build.flash_total=134217728
amken_bunny.menu.flash.134217728_109051904.build.flash_length=25161728
amken_bunny.menu.flash.134217728_109051904.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_109051904.build.fs_start=293597184
amken_bunny.menu.flash.134217728_109051904.build.fs_end=402649088
amken_bunny.menu.flash.134217728_110100480=128MB (Sketch: 23MB, FS: 105MB)
amken_bunny.menu.flash.134217728_110100480.upload.maximum_size=24113152
amken_bunny.menu.flash.134217728_110100480.build.flash_total=134217728
amken_bunny.menu.flash.134217728_110100480.build.flash_length=24113152
amken_bunny.menu.flash.134217728_110100480.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_110100480.build.fs_start=292548608
amken_bunny.menu.flash.134217728_110100480.build.fs_end=402649088
amken_bunny.menu.flash.134217728_111149056=128MB (Sketch: 22MB, FS: 106MB)
amken_bunny.menu.flash.134217728_111149056.upload.maximum_size=23064576
amken_bunny.menu.flash.134217728_111149056.build.flash_total=134217728
amken_bunny.menu.flash.134217728_111149056.build.flash_length=23064576
amken_bunny.menu.flash.134217728_111149056.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_111149056.build.fs_start=291500032
amken_bunny.menu.flash.134217728_111149056.build.fs_end=402649088
amken_bunny.menu.flash.134217728_112197632=128MB (Sketch: 21MB, FS: 107MB)
amken_bunny.menu.flash.134217728_112197632.upload.maximum_size=22016000
amken_bunny.menu.flash.134217728_112197632.build.flash_total=134217728
amken_bunny.menu.flash.134217728_112197632.build.flash_length=22016000
amken_bunny.menu.flash.134217728_112197632.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_112197632.build.fs_start=290451456
amken_bunny.menu.flash.134217728_112197632.build.fs_end=402649088
amken_bunny.menu.flash.134217728_113246208=128MB (Sketch: 20MB, FS: 108MB)
amken_bunny.menu.flash.134217728_113246208.upload.maximum_size=20967424
amken_bunny.menu.flash.134217728_113246208.build.flash_total=134217728
amken_bunny.menu.flash.134217728_113246208.build.flash_length=20967424
amken_bunny.menu.flash.134217728_113246208.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_113246208.build.fs_start=289402880
amken_bunny.menu.flash.134217728_113246208.build.fs_end=402649088
amken_bunny.menu.flash.134217728_114294784=128MB (Sketch: 19MB, FS: 109MB)
amken_bunny.menu.flash.134217728_114294784.upload.maximum_size=19918848
amken_bunny.menu.flash.134217728_114294784.build.flash_total=134217728
amken_bunny.menu.flash.134217728_114294784.build.flash_length=19918848
amken_bunny.menu.flash.134217728_114294784.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_114294784.build.fs_start=288354304
amken_bunny.menu.flash.134217728_114294784.build.fs_end=402649088
amken_bunny.menu.flash.134217728_115343360=128MB (Sketch: 18MB, FS: 110MB)
amken_bunny.menu.flash.134217728_115343360.upload.maximum_size=18870272
amken_bunny.menu.flash.134217728_115343360.build.flash_total=134217728
amken_bunny.menu.flash.134217728_115343360.build.flash_length=18870272
amken_bunny.menu.flash.134217728_115343360.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_115343360.build.fs_start=287305728
amken_bunny.menu.flash.134217728_115343360.build.fs_end=402649088
amken_bunny.menu.flash.134217728_116391936=128MB (Sketch: 17MB, FS: 111MB)
amken_bunny.menu.flash.134217728_116391936.upload.maximum_size=17821696
amken_bunny.menu.flash.134217728_116391936.build.flash_total=134217728
amken_bunny.menu.flash.134217728_116391936.build.flash_length=17821696
amken_bunny.menu.flash.134217728_116391936.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_116391936.build.fs_start=286257152
amken_bunny.menu.flash.134217728_116391936.build.fs_end=402649088
amken_bunny.menu.flash.134217728_117440512=128MB (Sketch: 16MB, FS: 112MB)
amken_bunny.menu.flash.134217728_117440512.upload.maximum_size=16773120
amken_bunny.menu.flash.134217728_117440512.build.flash_total=134217728
amken_bunny.menu.flash.134217728_117440512.build.flash_length=16773120
amken_bunny.menu.flash.134217728_117440512.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_117440512.build.fs_start=285208576
amken_bunny.menu.flash.134217728_117440512.build.fs_end=402649088
amken_bunny.menu.flash.134217728_118489088=128MB (Sketch: 15MB, FS: 113MB)
amken_bunny.menu.flash.134217728_118489088.upload.maximum_size=15724544
amken_bunny.menu.flash.134217728_118489088.build.flash_total=134217728
amken_bunny.menu.flash.134217728_118489088.build.flash_length=15724544
amken_bunny.menu.flash.134217728_118489088.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_118489088.build.fs_start=284160000
amken_bunny.menu.flash.134217728_118489088.build.fs_end=402649088
amken_bunny.menu.flash.134217728_119537664=128MB (Sketch: 14MB, FS: 114MB)
amken_bunny.menu.flash.134217728_119537664.upload.maximum_size=14675968
amken_bunny.menu.flash.134217728_119537664.build.flash_total=134217728
amken_bunny.menu.flash.134217728_119537664.build.flash_length=14675968
amken_bunny.menu.flash.134217728_119537664.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_119537664.build.fs_start=283111424
amken_bunny.menu.flash.134217728_119537664.build.fs_end=402649088
amken_bunny.menu.flash.134217728_120586240=128MB (Sketch: 13MB, FS: 115MB)
amken_bunny.menu.flash.134217728_120586240.upload.maximum_size=13627392
