amken3d/arduino-rp2040/boards.txt
amken_bunny.menu.flash.134217728_120586240.build.flash_total=134217728
amken_bunny.menu.flash.134217728_120586240.build.flash_length=13627392
amken_bunny.menu.flash.134217728_120586240.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_120586240.build.fs_start=282062848
amken_bunny.menu.flash.134217728_120586240.build.fs_end=402649088
amken_bunny.menu.flash.134217728_121634816=128MB (Sketch: 12MB, FS: 116MB)
amken_bunny.menu.flash.134217728_121634816.upload.maximum_size=12578816
amken_bunny.menu.flash.134217728_121634816.build.flash_total=134217728
amken_bunny.menu.flash.134217728_121634816.build.flash_length=12578816
amken_bunny.menu.flash.134217728_121634816.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_121634816.build.fs_start=281014272
amken_bunny.menu.flash.134217728_121634816.build.fs_end=402649088
amken_bunny.menu.flash.134217728_122683392=128MB (Sketch: 11MB, FS: 117MB)
amken_bunny.menu.flash.134217728_122683392.upload.maximum_size=11530240
amken_bunny.menu.flash.134217728_122683392.build.flash_total=134217728
amken_bunny.menu.flash.134217728_122683392.build.flash_length=11530240
amken_bunny.menu.flash.134217728_122683392.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_122683392.build.fs_start=279965696
amken_bunny.menu.flash.134217728_122683392.build.fs_end=402649088
amken_bunny.menu.flash.134217728_123731968=128MB (Sketch: 10MB, FS: 118MB)
amken_bunny.menu.flash.134217728_123731968.upload.maximum_size=10481664
amken_bunny.menu.flash.134217728_123731968.build.flash_total=134217728
amken_bunny.menu.flash.134217728_123731968.build.flash_length=10481664
amken_bunny.menu.flash.134217728_123731968.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_123731968.build.fs_start=278917120
amken_bunny.menu.flash.134217728_123731968.build.fs_end=402649088
amken_bunny.menu.flash.134217728_124780544=128MB (Sketch: 9MB, FS: 119MB)
amken_bunny.menu.flash.134217728_124780544.upload.maximum_size=9433088
amken_bunny.menu.flash.134217728_124780544.build.flash_total=134217728
amken_bunny.menu.flash.134217728_124780544.build.flash_length=9433088
amken_bunny.menu.flash.134217728_124780544.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_124780544.build.fs_start=277868544
amken_bunny.menu.flash.134217728_124780544.build.fs_end=402649088
amken_bunny.menu.flash.134217728_125829120=128MB (Sketch: 8MB, FS: 120MB)
amken_bunny.menu.flash.134217728_125829120.upload.maximum_size=8384512
amken_bunny.menu.flash.134217728_125829120.build.flash_total=134217728
amken_bunny.menu.flash.134217728_125829120.build.flash_length=8384512
amken_bunny.menu.flash.134217728_125829120.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_125829120.build.fs_start=276819968
amken_bunny.menu.flash.134217728_125829120.build.fs_end=402649088
amken_bunny.menu.flash.134217728_126877696=128MB (Sketch: 7MB, FS: 121MB)
amken_bunny.menu.flash.134217728_126877696.upload.maximum_size=7335936
amken_bunny.menu.flash.134217728_126877696.build.flash_total=134217728
amken_bunny.menu.flash.134217728_126877696.build.flash_length=7335936
amken_bunny.menu.flash.134217728_126877696.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_126877696.build.fs_start=275771392
amken_bunny.menu.flash.134217728_126877696.build.fs_end=402649088
amken_bunny.menu.flash.134217728_127926272=128MB (Sketch: 6MB, FS: 122MB)
amken_bunny.menu.flash.134217728_127926272.upload.maximum_size=6287360
amken_bunny.menu.flash.134217728_127926272.build.flash_total=134217728
amken_bunny.menu.flash.134217728_127926272.build.flash_length=6287360
amken_bunny.menu.flash.134217728_127926272.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_127926272.build.fs_start=274722816
amken_bunny.menu.flash.134217728_127926272.build.fs_end=402649088
amken_bunny.menu.flash.134217728_128974848=128MB (Sketch: 5MB, FS: 123MB)
amken_bunny.menu.flash.134217728_128974848.upload.maximum_size=5238784
amken_bunny.menu.flash.134217728_128974848.build.flash_total=134217728
amken_bunny.menu.flash.134217728_128974848.build.flash_length=5238784
amken_bunny.menu.flash.134217728_128974848.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_128974848.build.fs_start=273674240
amken_bunny.menu.flash.134217728_128974848.build.fs_end=402649088
amken_bunny.menu.flash.134217728_130023424=128MB (Sketch: 4MB, FS: 124MB)
amken_bunny.menu.flash.134217728_130023424.upload.maximum_size=4190208
amken_bunny.menu.flash.134217728_130023424.build.flash_total=134217728
amken_bunny.menu.flash.134217728_130023424.build.flash_length=4190208
amken_bunny.menu.flash.134217728_130023424.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_130023424.build.fs_start=272625664
amken_bunny.menu.flash.134217728_130023424.build.fs_end=402649088
amken_bunny.menu.flash.134217728_131072000=128MB (Sketch: 3MB, FS: 125MB)
amken_bunny.menu.flash.134217728_131072000.upload.maximum_size=3141632
amken_bunny.menu.flash.134217728_131072000.build.flash_total=134217728
amken_bunny.menu.flash.134217728_131072000.build.flash_length=3141632
amken_bunny.menu.flash.134217728_131072000.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_131072000.build.fs_start=271577088
amken_bunny.menu.flash.134217728_131072000.build.fs_end=402649088
amken_bunny.menu.flash.134217728_132120576=128MB (Sketch: 2MB, FS: 126MB)
amken_bunny.menu.flash.134217728_132120576.upload.maximum_size=2093056
amken_bunny.menu.flash.134217728_132120576.build.flash_total=134217728
amken_bunny.menu.flash.134217728_132120576.build.flash_length=2093056
amken_bunny.menu.flash.134217728_132120576.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_132120576.build.fs_start=270528512
amken_bunny.menu.flash.134217728_132120576.build.fs_end=402649088
amken_bunny.menu.flash.134217728_133169152=128MB (Sketch: 1MB, FS: 127MB)
amken_bunny.menu.flash.134217728_133169152.upload.maximum_size=1044480
amken_bunny.menu.flash.134217728_133169152.build.flash_total=134217728
amken_bunny.menu.flash.134217728_133169152.build.flash_length=1044480
amken_bunny.menu.flash.134217728_133169152.build.eeprom_start=402649088
amken_bunny.menu.flash.134217728_133169152.build.fs_start=269479936
amken_bunny.menu.flash.134217728_133169152.build.fs_end=402649088
amken_bunny.menu.freq.133=133 MHz
amken_bunny.menu.freq.133.build.f_cpu=133000000L
amken_bunny.menu.freq.50=50 MHz
amken_bunny.menu.freq.50.build.f_cpu=50000000L
amken_bunny.menu.freq.100=100 MHz
amken_bunny.menu.freq.100.build.f_cpu=100000000L
amken_bunny.menu.freq.120=120 MHz
amken_bunny.menu.freq.120.build.f_cpu=120000000L
amken_bunny.menu.freq.125=125 MHz
amken_bunny.menu.freq.125.build.f_cpu=125000000L
amken_bunny.menu.freq.128=128 MHz
amken_bunny.menu.freq.128.build.f_cpu=128000000L
amken_bunny.menu.freq.150=150 MHz (Overclock)
amken_bunny.menu.freq.150.build.f_cpu=150000000L
amken_bunny.menu.freq.175=175 MHz (Overclock)
amken_bunny.menu.freq.175.build.f_cpu=175000000L
amken_bunny.menu.freq.200=200 MHz (Overclock)
amken_bunny.menu.freq.200.build.f_cpu=200000000L
amken_bunny.menu.freq.225=225 MHz (Overclock)
amken_bunny.menu.freq.225.build.f_cpu=225000000L
amken_bunny.menu.freq.240=240 MHz (Overclock)
amken_bunny.menu.freq.240.build.f_cpu=240000000L
amken_bunny.menu.freq.250=250 MHz (Overclock)
amken_bunny.menu.freq.250.build.f_cpu=250000000L
amken_bunny.menu.freq.275=275 MHz (Overclock)
amken_bunny.menu.freq.275.build.f_cpu=275000000L
amken_bunny.menu.freq.300=300 MHz (Overclock)
amken_bunny.menu.freq.300.build.f_cpu=300000000L
amken_bunny.menu.opt.Small=Small (-Os) (standard)
amken_bunny.menu.opt.Small.build.flags.optimize=-Os
amken_bunny.menu.opt.Optimize=Optimize (-O)
amken_bunny.menu.opt.Optimize.build.flags.optimize=-O
amken_bunny.menu.opt.Optimize2=Optimize More (-O2)
amken_bunny.menu.opt.Optimize2.build.flags.optimize=-O2
amken_bunny.menu.opt.Optimize3=Optimize Even More (-O3)
amken_bunny.menu.opt.Optimize3.build.flags.optimize=-O3
amken_bunny.menu.opt.Fast=Fast (-Ofast) (maybe slower)
amken_bunny.menu.opt.Fast.build.flags.optimize=-Ofast
amken_bunny.menu.opt.Debug=Debug (-Og)
amken_bunny.menu.opt.Debug.build.flags.optimize=-Og
amken_bunny.menu.rtti.Disabled=Disabled
amken_bunny.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
amken_bunny.menu.rtti.Enabled=Enabled
amken_bunny.menu.rtti.Enabled.build.flags.rtti=
amken_bunny.menu.stackprotect.Disabled=Disabled
amken_bunny.menu.stackprotect.Disabled.build.flags.stackprotect=
amken_bunny.menu.stackprotect.Enabled=Enabled
amken_bunny.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
amken_bunny.menu.exceptions.Disabled=Disabled
amken_bunny.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
amken_bunny.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
amken_bunny.menu.exceptions.Enabled=Enabled
amken_bunny.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
amken_bunny.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
amken_bunny.menu.dbgport.Disabled=Disabled
amken_bunny.menu.dbgport.Disabled.build.debug_port=
amken_bunny.menu.dbgport.Serial=Serial
amken_bunny.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
amken_bunny.menu.dbgport.Serial1=Serial1
amken_bunny.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
amken_bunny.menu.dbgport.Serial2=Serial2
amken_bunny.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
amken_bunny.menu.dbglvl.None=None
amken_bunny.menu.dbglvl.None.build.debug_level=
amken_bunny.menu.dbglvl.Core=Core
amken_bunny.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
amken_bunny.menu.dbglvl.SPI=SPI
amken_bunny.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
amken_bunny.menu.dbglvl.Wire=Wire
amken_bunny.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
amken_bunny.menu.dbglvl.Bluetooth=Bluetooth
amken_bunny.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
amken_bunny.menu.dbglvl.All=All
amken_bunny.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
amken_bunny.menu.dbglvl.NDEBUG=NDEBUG
amken_bunny.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
amken_bunny.menu.usbstack.picosdk=Pico SDK
amken_bunny.menu.usbstack.picosdk.build.usbstack_flags=
amken_bunny.menu.usbstack.tinyusb=Adafruit TinyUSB
amken_bunny.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_bunny.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
amken_bunny.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_bunny.menu.usbstack.nousb=No USB
amken_bunny.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
amken_bunny.menu.ipbtstack.ipv4only=IPv4 Only
amken_bunny.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
amken_bunny.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
amken_bunny.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
amken_bunny.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
amken_bunny.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
amken_bunny.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
amken_bunny.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
amken_bunny.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_bunny.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
amken_bunny.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
amken_bunny.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_bunny.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
amken_bunny.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
amken_bunny.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
amken_bunny.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
amken_bunny.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
amken_bunny.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
amken_bunny.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
amken_bunny.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=libpicow-ipv6-btc-ble-big.a
amken_bunny.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
amken_bunny.menu.uploadmethod.default=Default (UF2)
amken_bunny.menu.uploadmethod.default.build.ram_length=256k
amken_bunny.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
amken_bunny.menu.uploadmethod.default.upload.maximum_data_size=262144
amken_bunny.menu.uploadmethod.default.upload.tool=uf2conv
amken_bunny.menu.uploadmethod.default.upload.tool.default=uf2conv
amken_bunny.menu.uploadmethod.default.upload.tool.network=uf2conv-network
amken_bunny.menu.uploadmethod.picotool=Picotool
amken_bunny.menu.uploadmethod.picotool.build.ram_length=256k
amken_bunny.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
amken_bunny.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
amken_bunny.menu.uploadmethod.picotool.upload.maximum_data_size=262144
amken_bunny.menu.uploadmethod.picotool.upload.tool=picotool
amken_bunny.menu.uploadmethod.picotool.upload.tool.default=picotool
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
amken_bunny.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
amken_bunny.menu.uploadmethod.picodebug=Pico-Debug
amken_bunny.menu.uploadmethod.picodebug.build.ram_length=240k
amken_bunny.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
amken_bunny.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
amken_bunny.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
amken_bunny.menu.uploadmethod.picodebug.upload.tool=picodebug
amken_bunny.menu.uploadmethod.picodebug.upload.tool.default=picodebug

