amken3d/arduino-rp2040/boards.txt
# -----------------------------------
# Amken Revelop eS
# -----------------------------------
amken_revelop_es.name=Amken Revelop eS
amken_revelop_es.vid.0=0x2770
amken_revelop_es.pid.0=0x7306
amken_revelop_es.upload_port.0.vid=0x2770
amken_revelop_es.upload_port.0.pid=0x7306
amken_revelop_es.build.usbvid=-DUSBD_VID=0x2770
amken_revelop_es.build.usbpid=-DUSBD_PID=0x7306
amken_revelop_es.build.usbpwr=-DUSBD_MAX_POWER_MA=250
amken_revelop_es.build.board=AMKEN_ES
amken_revelop_es.build.mcu=cortex-m0plus
amken_revelop_es.build.variant=amken_revelop_es
amken_revelop_es.upload.maximum_size=16777216
amken_revelop_es.upload.wait_for_upload_port=true
amken_revelop_es.upload.erase_cmd=
amken_revelop_es.serial.disableDTR=false
amken_revelop_es.serial.disableRTS=false
amken_revelop_es.build.f_cpu=125000000
amken_revelop_es.build.led=
amken_revelop_es.build.core=rp2040
amken_revelop_es.build.ldscript=memmap_default.ld
amken_revelop_es.build.boot2=boot2_w25q16jvxq_4_padded_checksum
amken_revelop_es.build.usb_manufacturer="Amken"
amken_revelop_es.build.usb_product="Revelop eS"
amken_revelop_es.build.extra_flags=
amken_revelop_es.menu.flash.16777216_0=16MB (no FS)
amken_revelop_es.menu.flash.16777216_0.upload.maximum_size=16773120
amken_revelop_es.menu.flash.16777216_0.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_0.build.flash_length=16773120
amken_revelop_es.menu.flash.16777216_0.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_0.build.fs_start=285208576
amken_revelop_es.menu.flash.16777216_0.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
amken_revelop_es.menu.flash.16777216_65536.upload.maximum_size=16707584
amken_revelop_es.menu.flash.16777216_65536.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_65536.build.flash_length=16707584
amken_revelop_es.menu.flash.16777216_65536.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_65536.build.fs_start=285143040
amken_revelop_es.menu.flash.16777216_65536.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
amken_revelop_es.menu.flash.16777216_131072.upload.maximum_size=16642048
amken_revelop_es.menu.flash.16777216_131072.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_131072.build.flash_length=16642048
amken_revelop_es.menu.flash.16777216_131072.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_131072.build.fs_start=285077504
amken_revelop_es.menu.flash.16777216_131072.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
amken_revelop_es.menu.flash.16777216_262144.upload.maximum_size=16510976
amken_revelop_es.menu.flash.16777216_262144.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_262144.build.flash_length=16510976
amken_revelop_es.menu.flash.16777216_262144.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_262144.build.fs_start=284946432
amken_revelop_es.menu.flash.16777216_262144.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
amken_revelop_es.menu.flash.16777216_524288.upload.maximum_size=16248832
amken_revelop_es.menu.flash.16777216_524288.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_524288.build.flash_length=16248832
amken_revelop_es.menu.flash.16777216_524288.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_524288.build.fs_start=284684288
amken_revelop_es.menu.flash.16777216_524288.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
amken_revelop_es.menu.flash.16777216_1048576.upload.maximum_size=15724544
amken_revelop_es.menu.flash.16777216_1048576.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_1048576.build.flash_length=15724544
amken_revelop_es.menu.flash.16777216_1048576.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_1048576.build.fs_start=284160000
amken_revelop_es.menu.flash.16777216_1048576.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
amken_revelop_es.menu.flash.16777216_2097152.upload.maximum_size=14675968
amken_revelop_es.menu.flash.16777216_2097152.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_2097152.build.flash_length=14675968
amken_revelop_es.menu.flash.16777216_2097152.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_2097152.build.fs_start=283111424
amken_revelop_es.menu.flash.16777216_2097152.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
amken_revelop_es.menu.flash.16777216_3145728.upload.maximum_size=13627392
amken_revelop_es.menu.flash.16777216_3145728.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_3145728.build.flash_length=13627392
amken_revelop_es.menu.flash.16777216_3145728.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_3145728.build.fs_start=282062848
amken_revelop_es.menu.flash.16777216_3145728.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
amken_revelop_es.menu.flash.16777216_4194304.upload.maximum_size=12578816
amken_revelop_es.menu.flash.16777216_4194304.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_4194304.build.flash_length=12578816
amken_revelop_es.menu.flash.16777216_4194304.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_4194304.build.fs_start=281014272
amken_revelop_es.menu.flash.16777216_4194304.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
amken_revelop_es.menu.flash.16777216_5242880.upload.maximum_size=11530240
amken_revelop_es.menu.flash.16777216_5242880.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_5242880.build.flash_length=11530240
amken_revelop_es.menu.flash.16777216_5242880.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_5242880.build.fs_start=279965696
amken_revelop_es.menu.flash.16777216_5242880.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
amken_revelop_es.menu.flash.16777216_6291456.upload.maximum_size=10481664
amken_revelop_es.menu.flash.16777216_6291456.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_6291456.build.flash_length=10481664
amken_revelop_es.menu.flash.16777216_6291456.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_6291456.build.fs_start=278917120
amken_revelop_es.menu.flash.16777216_6291456.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
amken_revelop_es.menu.flash.16777216_7340032.upload.maximum_size=9433088
amken_revelop_es.menu.flash.16777216_7340032.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_7340032.build.flash_length=9433088
amken_revelop_es.menu.flash.16777216_7340032.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_7340032.build.fs_start=277868544
amken_revelop_es.menu.flash.16777216_7340032.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
amken_revelop_es.menu.flash.16777216_8388608.upload.maximum_size=8384512
amken_revelop_es.menu.flash.16777216_8388608.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_8388608.build.flash_length=8384512
amken_revelop_es.menu.flash.16777216_8388608.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_8388608.build.fs_start=276819968
amken_revelop_es.menu.flash.16777216_8388608.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
amken_revelop_es.menu.flash.16777216_9437184.upload.maximum_size=7335936
amken_revelop_es.menu.flash.16777216_9437184.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_9437184.build.flash_length=7335936
amken_revelop_es.menu.flash.16777216_9437184.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_9437184.build.fs_start=275771392
amken_revelop_es.menu.flash.16777216_9437184.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
amken_revelop_es.menu.flash.16777216_10485760.upload.maximum_size=6287360
amken_revelop_es.menu.flash.16777216_10485760.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_10485760.build.flash_length=6287360
amken_revelop_es.menu.flash.16777216_10485760.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_10485760.build.fs_start=274722816
amken_revelop_es.menu.flash.16777216_10485760.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
amken_revelop_es.menu.flash.16777216_11534336.upload.maximum_size=5238784
amken_revelop_es.menu.flash.16777216_11534336.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_11534336.build.flash_length=5238784
amken_revelop_es.menu.flash.16777216_11534336.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_11534336.build.fs_start=273674240
amken_revelop_es.menu.flash.16777216_11534336.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
amken_revelop_es.menu.flash.16777216_12582912.upload.maximum_size=4190208
amken_revelop_es.menu.flash.16777216_12582912.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_12582912.build.flash_length=4190208
amken_revelop_es.menu.flash.16777216_12582912.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_12582912.build.fs_start=272625664
amken_revelop_es.menu.flash.16777216_12582912.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
amken_revelop_es.menu.flash.16777216_13631488.upload.maximum_size=3141632
amken_revelop_es.menu.flash.16777216_13631488.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_13631488.build.flash_length=3141632
amken_revelop_es.menu.flash.16777216_13631488.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_13631488.build.fs_start=271577088
amken_revelop_es.menu.flash.16777216_13631488.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
amken_revelop_es.menu.flash.16777216_14680064.upload.maximum_size=2093056
amken_revelop_es.menu.flash.16777216_14680064.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_14680064.build.flash_length=2093056
amken_revelop_es.menu.flash.16777216_14680064.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_14680064.build.fs_start=270528512
amken_revelop_es.menu.flash.16777216_14680064.build.fs_end=285208576
amken_revelop_es.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
amken_revelop_es.menu.flash.16777216_15728640.upload.maximum_size=1044480
amken_revelop_es.menu.flash.16777216_15728640.build.flash_total=16777216
amken_revelop_es.menu.flash.16777216_15728640.build.flash_length=1044480
amken_revelop_es.menu.flash.16777216_15728640.build.eeprom_start=285208576
amken_revelop_es.menu.flash.16777216_15728640.build.fs_start=269479936
amken_revelop_es.menu.flash.16777216_15728640.build.fs_end=285208576
amken_revelop_es.menu.freq.133=133 MHz
amken_revelop_es.menu.freq.133.build.f_cpu=133000000L
amken_revelop_es.menu.freq.50=50 MHz
amken_revelop_es.menu.freq.50.build.f_cpu=50000000L
amken_revelop_es.menu.freq.100=100 MHz
amken_revelop_es.menu.freq.100.build.f_cpu=100000000L
amken_revelop_es.menu.freq.120=120 MHz
amken_revelop_es.menu.freq.120.build.f_cpu=120000000L
amken_revelop_es.menu.freq.125=125 MHz
amken_revelop_es.menu.freq.125.build.f_cpu=125000000L
amken_revelop_es.menu.freq.128=128 MHz
amken_revelop_es.menu.freq.128.build.f_cpu=128000000L
amken_revelop_es.menu.freq.150=150 MHz (Overclock)
amken_revelop_es.menu.freq.150.build.f_cpu=150000000L
amken_revelop_es.menu.freq.175=175 MHz (Overclock)
amken_revelop_es.menu.freq.175.build.f_cpu=175000000L
amken_revelop_es.menu.freq.200=200 MHz (Overclock)
amken_revelop_es.menu.freq.200.build.f_cpu=200000000L
amken_revelop_es.menu.freq.225=225 MHz (Overclock)
amken_revelop_es.menu.freq.225.build.f_cpu=225000000L
amken_revelop_es.menu.freq.240=240 MHz (Overclock)
amken_revelop_es.menu.freq.240.build.f_cpu=240000000L
amken_revelop_es.menu.freq.250=250 MHz (Overclock)
amken_revelop_es.menu.freq.250.build.f_cpu=250000000L
amken_revelop_es.menu.freq.275=275 MHz (Overclock)
amken_revelop_es.menu.freq.275.build.f_cpu=275000000L
amken_revelop_es.menu.freq.300=300 MHz (Overclock)
amken_revelop_es.menu.freq.300.build.f_cpu=300000000L
amken_revelop_es.menu.opt.Small=Small (-Os) (standard)
amken_revelop_es.menu.opt.Small.build.flags.optimize=-Os
amken_revelop_es.menu.opt.Optimize=Optimize (-O)
amken_revelop_es.menu.opt.Optimize.build.flags.optimize=-O
amken_revelop_es.menu.opt.Optimize2=Optimize More (-O2)
amken_revelop_es.menu.opt.Optimize2.build.flags.optimize=-O2
amken_revelop_es.menu.opt.Optimize3=Optimize Even More (-O3)
amken_revelop_es.menu.opt.Optimize3.build.flags.optimize=-O3
amken_revelop_es.menu.opt.Fast=Fast (-Ofast) (maybe slower)
amken_revelop_es.menu.opt.Fast.build.flags.optimize=-Ofast
amken_revelop_es.menu.opt.Debug=Debug (-Og)
amken_revelop_es.menu.opt.Debug.build.flags.optimize=-Og
amken_revelop_es.menu.rtti.Disabled=Disabled
amken_revelop_es.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
amken_revelop_es.menu.rtti.Enabled=Enabled
amken_revelop_es.menu.rtti.Enabled.build.flags.rtti=
amken_revelop_es.menu.stackprotect.Disabled=Disabled
amken_revelop_es.menu.stackprotect.Disabled.build.flags.stackprotect=
amken_revelop_es.menu.stackprotect.Enabled=Enabled
amken_revelop_es.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
amken_revelop_es.menu.exceptions.Disabled=Disabled
amken_revelop_es.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
amken_revelop_es.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
amken_revelop_es.menu.exceptions.Enabled=Enabled
amken_revelop_es.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
amken_revelop_es.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
amken_revelop_es.menu.dbgport.Disabled=Disabled
amken_revelop_es.menu.dbgport.Disabled.build.debug_port=
amken_revelop_es.menu.dbgport.Serial=Serial
amken_revelop_es.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
amken_revelop_es.menu.dbgport.Serial1=Serial1
amken_revelop_es.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
amken_revelop_es.menu.dbgport.Serial2=Serial2
amken_revelop_es.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
amken_revelop_es.menu.dbglvl.None=None
amken_revelop_es.menu.dbglvl.None.build.debug_level=
amken_revelop_es.menu.dbglvl.Core=Core
amken_revelop_es.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
amken_revelop_es.menu.dbglvl.SPI=SPI
amken_revelop_es.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
amken_revelop_es.menu.dbglvl.Wire=Wire
amken_revelop_es.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
amken_revelop_es.menu.dbglvl.Bluetooth=Bluetooth
amken_revelop_es.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
amken_revelop_es.menu.dbglvl.All=All
amken_revelop_es.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
amken_revelop_es.menu.dbglvl.NDEBUG=NDEBUG
amken_revelop_es.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
amken_revelop_es.menu.usbstack.picosdk=Pico SDK
amken_revelop_es.menu.usbstack.picosdk.build.usbstack_flags=
amken_revelop_es.menu.usbstack.tinyusb=Adafruit TinyUSB
amken_revelop_es.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_revelop_es.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
amken_revelop_es.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
amken_revelop_es.menu.usbstack.nousb=No USB
amken_revelop_es.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
amken_revelop_es.menu.ipbtstack.ipv4only=IPv4 Only
amken_revelop_es.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
amken_revelop_es.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
amken_revelop_es.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
amken_revelop_es.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
amken_revelop_es.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
amken_revelop_es.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
amken_revelop_es.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
amken_revelop_es.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_revelop_es.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
amken_revelop_es.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
amken_revelop_es.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
amken_revelop_es.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
amken_revelop_es.menu.ipbtstack.ipv4onlybig.build.libpicow=libpicow-noipv6-nobtc-noble-big.a
amken_revelop_es.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_revelop_es.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
amken_revelop_es.menu.ipbtstack.ipv4ipv6big.build.libpicow=libpicow-ipv6-nobtc-noble-big.a
amken_revelop_es.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
amken_revelop_es.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
amken_revelop_es.menu.ipbtstack.ipv4btcblebig.build.libpicow=libpicow-noipv6-btc-ble-big.a
amken_revelop_es.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -D__LWIP_MEMMULT=2
